export const EXCULDE_FIELD = {
  在线趋势: ['日期', '时间', '分钟级时间戳', '小店随心推', '品牌广告', '千川品牌广告', '发放优惠券', '秒杀', '场记', '其他广告'],
  广告趋势: ['日期', '时间', '分钟级时间戳', '全域推广ROI', '全域推广消耗', '全域推广成交金额', '全域推广成交订单'],
  流量来源趋势: ['日期', '时间', '分钟级时间戳', '品牌广告', '千川品牌广告', '其他广告', '小店随心推'],
  主播小时数据: [
    '日期',
    '时间',
    '主播小时数据 -GMV(订单)',
    '主播小时数据 -成交件数(订单)',
    '主播小时数据 -退款金额',
    '主播小时数据 -确认收货金额(订单)',
    '主播小时数据 -退款金额(订单)',
    '主播小时数据 -有效GMV(订单)',
    '主播小时数据 -未支付订单数(订单)',
    '主播小时数据 -创建订单数(订单)',
    '主播小时数据 -订单支付率(订单)',
    '主播小时数据 -预售创建金额',
    '主播小时数据 -退款金额占比(订单)',
    '主播小时数据 -退款订单占比(订单)',
    '主播小时数据 -退款订单数(订单)',
    '主播小时数据 -成交智能优惠券金额',
    '主播小时数据 -累计观看次数',
    '主播小时数据 -累计曝光次数',
    '主播小时数据 -曝光-点击转化率(次数)',
    '主播小时数据 -曝光-成交转化率(次数)',
    '主播小时数据 -全部付费流量',
    '主播小时数据 -全部自然流量',
    '主播小时数据 -点击至成交件数转化率(订单)',
    '主播小时数据 -商品点击次数',
    '主播小时数据 -商品讲解时长',
    '主播小时数据 -讲解次数',
    '主播小时数据 -商品曝光人次',
    '主播小时数据 -广告下单数',
    '主播小时数据 -广告下单率',
    '主播小时数据 -整体下单率',
    '主播小时数据 -查看购物车次数',
    '主播小时数据 -广告转化数',
    '主播小时数据 -广告转化率',
    '主播小时数据 -广告点击数',
    '主播小时数据 -广告点击单价',
    '主播小时数据 -全域推广ROI',
    '主播小时数据 -全域推广消耗',
    '主播小时数据 -全域推广成交金额',
    '主播小时数据 -全域推广成交订单数',
    '主播小时数据 -人均停留时长',
    '主播小时数据 -评论人数',
    '主播小时数据 -观看-加购物团率(人数)',
    '主播小时数据 -观看-加直播团率(人数)',
    '主播小时数据 -新加直播团人数',
    '主播小时数据 -新加购物团人数',
    '主播小时数据 -成交粉丝数',
    '主播小时数据 -广告点击率',
    '主播小时数据 -广告展示次数',
    '主播小时数据 -平均千次展现费用',
    '主播小时数据 -广告预售订单数',
    '主播小时数据 -广告预售订单金额',
    '主播小时数据 -广告引导超1分钟观看人数',
    '主播小时数据 -整体成单率',
    '主播小时数据 -商品点击成本',
    '主播小时数据 -广告GPM',
  ]
};

export const SPECIAL_FIELD = {
  在线趋势: ['讲解', '上架', '发放优惠券', '秒杀', '场记', '福袋'],
  广告趋势: [],
  流量来源趋势: [],
  主播小时数据: []
}

const blue = [
  '#deebf7',
  '#c6dbef',
  '#9ecae1',
  '#6baed6',
  '#4292c6',
  '#2171b5',
  '#08519c',
  // '#08306b',  // 扩展的颜色
  // '#041f4f',  // 扩展的颜色
  // '#021229'   // 扩展的颜色
];
const red = [
  "#FFCCCC", // 浅红色
  "#FFB2B2",
  "#FF9999",
  "#FF8080", // 中等红色
  "#FF6666",
  "#FF4D4D",
  "#FF3333"  // 深红色
]
const green = [
  "#D5F5E3", // 浅绿色
  "#ABEBC6",
  "#82E0AA",
  "#58D68D", // 中等绿色
  "#2ECC71",
  "#28B463",
  "#1E8449"  // 深绿色
]

const brown = [
  "#DEB887", // 浅褐色
  "#D2B48C", // 深杏仁色
  "#CD853F", // 秘鲁色
  "#A52A2A", // 深褐色
  "#8B4513", // 深褐色
  "#703B1E", // 栗色
  "#4E342E"  // 棕褐色
]

const purple = [
  "#B76BFF",   // 浅紫色
  "#A95DE3",
  "#9B4FC7",
  "#8D41AB",
  "#7F3390",
  "#712476",
  "#63165A"    // 深紫色
]
export const NORMALIZED_FIELD = {
  在线趋势: [
    {
      value: ['实时在线人数', '进入直播间人数', '离开直播间人数', "全部付费流量", "全部自然流量", "小店随心推", "品牌广告",
        "千川品牌广告", "千川pc版", "其他广告", "短视频引流", "直播广场", "活动页", "搜索", "推荐feed", "抖音商城", "头条西瓜",
        "同城", "其他推荐场景", "其他", '关注', '个人主页&店铺&橱窗', '新增粉丝数', '新加团人数'],
      colors: blue
    }, {
      value: ['成交金额'],
      colors: red
    }, {
      value: ['评论次数', '点赞次数', "分享次数", "打赏次数", "讲解", "上架", "发放优惠券", "秒杀", "场记", "福袋"],
      colors: green
    }
  ],
  广告趋势: [
    {
      value: ["标准推广ROI", "整体ROI", "投放ROI", "全域推广ROI"],
      colors: blue
    },
    {
      value: ["投放成单率", "广告点击率", '引导观众占比：引导进入人次/直播间观看人次', '引导成交占比：广告成交金额/累计成交金额'],
      colors: red
    },
    {
      value: ["投放消耗", "标准推广消耗", "全域推广消耗", "标准推广成交金额", "全域推广成交金额"],
      colors: green
    },
    {
      value: ['标准推广成交订单', '全域推广成交订单'],
      colors: blue
    },
    {
      value: ['直播间观看人数', '新增粉丝人次'],
      colors: red
    },
    {
      value: ['直播间评论次数'],
      colors: green
    }
  ],
  流量来源趋势: [
    {
      value: ["全部付费流量", "全部自然流量", "直播广场", "推荐feed", "同城", "短视频引流", "其他", "关注", "个人主页", "抖音商城", "活动页", "头条西瓜", "品牌广告", "千川品牌广告", "其他广告", "小店随心推", "千川PC版", "搜索", "其他推荐场景"],
      colors: blue
    }
  ],
  主播小时数据: [
    {
      value: ['小徐', '徐悠雯', '玉玉', '张璐', '心月', '轩轩', '小柏', '薛雅文'],
      colors: blue
    }
  ]
}
